<a href="https://colab.research.google.com/github/DaveWates/Assignment-ISYS5002/blob/main/Assignment3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**This Program determines the salary of key executive personnel of companies whereby a user  provides a stock market ticker. (I have chosen the major Australian Banks as a test sample). It will then calculate the tax payable on the reported income.** 

**The ticker is input in Yahoo Finance link https://finance.yahoo.com/?fr=sycsrp_catchall where the URL link for the company profile page may be sourced.**

**1. Load the packages**

In [ ]:
!pip install kora -q
from kora.selenium import wd
from bs4 import BeautifulSoup

**2.Prompt the user for the ticker and locate the URL from Yahoo Finance.**

In [ ]:
#Prompt user for Bank
bank = input('Which bank do you want to search?;choose from ANZ, CBA, NAB, WBC = ')

urls = ('https://finance.yahoo.com/quote/ANZ.AX/profile?p=ANZ.AX',
       'https://finance.yahoo.com/quote/CBA.AX/profile?p=CBA.AX',
       'https://finance.yahoo.com/quote/NAB.AX/profile?p=NAB.AX',
       'https://finance.yahoo.com/quote/WBC.AX/profile?p=WBC.AX')

def get_url():
  for url in urls:
   if bank == 'ANZ':
    return (urls[0])
   if bank == 'CBA':
    return (urls[1])
   if bank == 'NAB':
    return (urls[2])
   if bank == 'WBC':
    return (urls[3])

print('The url required is', get_url())

Which bank do you want to search?;choose from ANZ, CBA, NAB, WBC = WBC
The url required is https://finance.yahoo.com/quote/WBC.AX/profile?p=WBC.AX

**3. Use the related URL to scrape the company profile page.**

In [ ]:
wd.get(get_url())
soup = BeautifulSoup(wd.page_source, 'html.parser')
tables = soup.find_all('table')
for table in tables:
  body = table.find('tbody')
  rows = body.find_all('tr')
  for row in rows:
    data = row.find_all('td')
    for txt in data:
      print(txt.text)
    print()

Mr. Peter Francis King F.C.A., BEc, FCA
CEO, MD & Director
2.81M
N/A
1970

Mr. Michael  Rowland B.Com., F.C.A.
Chief Financial Officer
1.22M
N/A
1962

Mr. Leslie Wilson Vance
Group Exec. of Financial Crime, Compliance & Conduct
1M
N/A
1971

Ms. Rebecca  Lim B Econ, L.L.B., LLB (Hons)
Group Gen. Counsel & Enterprise Exec.
871.92k
N/A
1972

Ms. Christine  Parker
Group Exec. of HR
999.8k
N/A
1960

Mr. Jason  Yetton B.Com., BCom, TGMP, GDAppFin
Chief Exec. of Specialist Bus.es & Group Strategy
1.25M
N/A
1970

Ms. Carolyn  McCann B.A.
Group Exec. of Customer & Corp. Relations
941k
N/A
1973

Mr. David  Stephen
Chief Risk Officer
1.89M
N/A
1965

Mr. Scott  Collary
Chief Operating Officer
N/A
N/A
N/A

Mr. Andrew  Bowden
Head of Investor Relations
N/A
N/A
N/A

4. **Manipulate the data for ease of reference using Pandas.**

In [193]:
import pandas as pd

In [194]:
# Creating a data frame df.
df = pd.DataFrame({'NAME':['Peter Francis King', 'Michael  Rowland', 'Leslie Wilson Vance', 'Rebecca  Lim','Christine  Parker','Jason  Yetton','Carolyn  McCann','David  Stephen'],'SALARY':[2810000, 1220000, 1000000, 871920,999800,1250000,941000,1890000]})
# Head displays only the executives with reported income from the data frame.
df.head(10)

                  NAME   SALARY
0   Peter Francis King  2810000
1     Michael  Rowland  1220000
2  Leslie Wilson Vance  1000000
3         Rebecca  Lim   871920
4    Christine  Parker   999800
5        Jason  Yetton  1250000
6      Carolyn  McCann   941000
7       David  Stephen  1890000

**5. Determine tax payable on the reported income using the ATO tax rate table.**

[Resident tax rates 2021–22
Taxable income](https://www.ato.gov.au/rates/individual-income-tax-rates/)

Income            | Tax on this income 
------------------|----------------------
0 – \$18,200       | Nil
\$18,201 – \$45,000 | 19 cents for each \$1 over \$18,200
\$45,001 – \$120,000 | \$5,092 plus 32.5 cents for each \$1 over \$45,000
\$120,001 – \$180,000 |  \$29,467 plus 37 cents for each \$1 over \$120,000
\$180,001 and over | \$51,667 plus 45 cents for each \$1 over \$180,000

In [ ]:
# A formula to calculate tax payable based on the above rates

In [195]:
def calc_tax(income):
  if income <= 18200:
    tax = 0
  elif 18200 < income <= 45000:
    tax = (income - 18200) * 0.19
  elif 45000 < income <= 120000:
    tax = ((income - 45001) * 0.325) + 5092
  elif 120000 < income <= 180000:
    tax = ((income - 120001) * 0.37) + 29467
  elif 18000 < income: 
    tax = ((income - 180001) * 0.45) + 51667
  return tax

In [249]:
# Match Executive's name with reported salary

name = input('Please enter the Executives name from the list above  = ')
incomes= ('2810000','1220000','1000000','871920','999800','1250000','941000','1890000')

def get_salary_from_name():
  for income in incomes:
    if name == 'Peter Francis King':
     return (salary[0])
    if name == 'Michael Rowland':
     return (salary[1])
    if name == 'Leslie Wilson Vance':
     return (salary[2])
    if name == 'Rebecca Lim':
     return (salary[3]) 
    if name == 'Christine Parker':
     return (salary[4])
    if name == 'Jason Yetton':
     return (salary[5])
    if name == 'Carolyn McCann':
     return (salary[6])
    if name == 'David Stephen':
     return (salary[7])

print("The taxable salary is", get_salary_from_name())
income = int(get_salary_from_name())
tax = calc_tax(income)
print ("The tax payable on your income is",tax)

Please enter the Executives name from the list above  = Michael Rowland
The taxable salary is 1220000
The tax payable on your income is 519666.55